espressif/esp-idf/components/soc/esp32c5/include/soc/twai_reg.h
/** TWAI_DATA_10_REG register
 *  Data register 10.
 */
#define TWAI_DATA_10_REG (DR_REG_TWAI_BASE + 0x68)
/** TWAI_DATA_10 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, reserved with RO. In operation mode, when software initiate write
 *  operation, it is tx data register 10 and when software initiate read operation, it
 *  is rx data register 10.
 */
#define TWAI_DATA_10    0x000000FFU
#define TWAI_DATA_10_M  (TWAI_DATA_10_V << TWAI_DATA_10_S)
#define TWAI_DATA_10_V  0x000000FFU
#define TWAI_DATA_10_S  0

/** TWAI_DATA_11_REG register
 *  Data register 11.
 */
#define TWAI_DATA_11_REG (DR_REG_TWAI_BASE + 0x6c)
/** TWAI_DATA_11 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, reserved with RO. In operation mode, when software initiate write
 *  operation, it is tx data register 11 and when software initiate read operation, it
 *  is rx data register 11.
 */
#define TWAI_DATA_11    0x000000FFU
#define TWAI_DATA_11_M  (TWAI_DATA_11_V << TWAI_DATA_11_S)
#define TWAI_DATA_11_V  0x000000FFU
#define TWAI_DATA_11_S  0

/** TWAI_DATA_12_REG register
 *  Data register 12.
 */
#define TWAI_DATA_12_REG (DR_REG_TWAI_BASE + 0x70)
/** TWAI_DATA_12 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, reserved with RO. In operation mode, when software initiate write
 *  operation, it is tx data register 12 and when software initiate read operation, it
 *  is rx data register 12.
 */
#define TWAI_DATA_12    0x000000FFU
#define TWAI_DATA_12_M  (TWAI_DATA_12_V << TWAI_DATA_12_S)
#define TWAI_DATA_12_V  0x000000FFU
#define TWAI_DATA_12_S  0

/** TWAI_RX_MESSAGE_COUNTER_REG register
 *  Received message counter register.
 */
#define TWAI_RX_MESSAGE_COUNTER_REG (DR_REG_TWAI_BASE + 0x74)
/** TWAI_RX_MESSAGE_COUNTER : RO; bitpos: [6:0]; default: 0;
 *  Reflects the number of messages available within the RXFIFO. The value is
 *  incremented with each receive event and decremented by the release receive buffer
 *  command.
 */
#define TWAI_RX_MESSAGE_COUNTER    0x0000007FU
#define TWAI_RX_MESSAGE_COUNTER_M  (TWAI_RX_MESSAGE_COUNTER_V << TWAI_RX_MESSAGE_COUNTER_S)
#define TWAI_RX_MESSAGE_COUNTER_V  0x0000007FU
#define TWAI_RX_MESSAGE_COUNTER_S  0

/** TWAI_CLOCK_DIVIDER_REG register
 *  Clock divider register.
 */
#define TWAI_CLOCK_DIVIDER_REG (DR_REG_TWAI_BASE + 0x7c)
/** TWAI_CD : R/W; bitpos: [7:0]; default: 0;
 *  These bits are used to define the frequency at the external CLKOUT pin.
 */
#define TWAI_CD    0x000000FFU
#define TWAI_CD_M  (TWAI_CD_V << TWAI_CD_S)
#define TWAI_CD_V  0x000000FFU
#define TWAI_CD_S  0
/** TWAI_CLOCK_OFF : R/W; bitpos: [8]; default: 0;
 *  1: Disable the external CLKOUT pin. 0: Enable the external CLKOUT pin. Software has
 *  R/W permission in reset mode and RO in operation mode.
 */
#define TWAI_CLOCK_OFF    (BIT(8))
#define TWAI_CLOCK_OFF_M  (TWAI_CLOCK_OFF_V << TWAI_CLOCK_OFF_S)
#define TWAI_CLOCK_OFF_V  0x00000001U
#define TWAI_CLOCK_OFF_S  8

/** TWAI_SW_STANDBY_CFG_REG register
 *  Software configure standby pin directly.
 */
#define TWAI_SW_STANDBY_CFG_REG (DR_REG_TWAI_BASE + 0x80)
/** TWAI_SW_STANDBY_EN : R/W; bitpos: [0]; default: 0;
 *  Enable standby pin.
 */
#define TWAI_SW_STANDBY_EN    (BIT(0))
#define TWAI_SW_STANDBY_EN_M  (TWAI_SW_STANDBY_EN_V << TWAI_SW_STANDBY_EN_S)
#define TWAI_SW_STANDBY_EN_V  0x00000001U
#define TWAI_SW_STANDBY_EN_S  0
/** TWAI_SW_STANDBY_CLR : R/W; bitpos: [1]; default: 1;
 *  Clear standby pin.
 */
#define TWAI_SW_STANDBY_CLR    (BIT(1))
#define TWAI_SW_STANDBY_CLR_M  (TWAI_SW_STANDBY_CLR_V << TWAI_SW_STANDBY_CLR_S)
#define TWAI_SW_STANDBY_CLR_V  0x00000001U
#define TWAI_SW_STANDBY_CLR_S  1

/** TWAI_HW_CFG_REG register
 *  Hardware configure standby pin.
 */
#define TWAI_HW_CFG_REG (DR_REG_TWAI_BASE + 0x84)
/** TWAI_HW_STANDBY_EN : R/W; bitpos: [0]; default: 0;
 *  Enable function that hardware control standby pin.
 */
#define TWAI_HW_STANDBY_EN    (BIT(0))
#define TWAI_HW_STANDBY_EN_M  (TWAI_HW_STANDBY_EN_V << TWAI_HW_STANDBY_EN_S)
#define TWAI_HW_STANDBY_EN_V  0x00000001U
#define TWAI_HW_STANDBY_EN_S  0

/** TWAI_HW_STANDBY_CNT_REG register
 *  Configure standby counter.
 */
#define TWAI_HW_STANDBY_CNT_REG (DR_REG_TWAI_BASE + 0x88)
/** TWAI_STANDBY_WAIT_CNT : R/W; bitpos: [31:0]; default: 1;
 *  Configure the number of cycles before standby becomes high when TWAI_HW_STANDBY_EN
 *  is enabled.
 */
#define TWAI_STANDBY_WAIT_CNT    0xFFFFFFFFU
#define TWAI_STANDBY_WAIT_CNT_M  (TWAI_STANDBY_WAIT_CNT_V << TWAI_STANDBY_WAIT_CNT_S)
#define TWAI_STANDBY_WAIT_CNT_V  0xFFFFFFFFU
#define TWAI_STANDBY_WAIT_CNT_S  0

/** TWAI_IDLE_INTR_CNT_REG register
 *  Configure idle interrupt counter.
 */
#define TWAI_IDLE_INTR_CNT_REG (DR_REG_TWAI_BASE + 0x8c)
/** TWAI_IDLE_INTR_CNT : R/W; bitpos: [31:0]; default: 1;
 *  Configure the number of cycles before triggering idle interrupt.
 */
#define TWAI_IDLE_INTR_CNT    0xFFFFFFFFU
#define TWAI_IDLE_INTR_CNT_M  (TWAI_IDLE_INTR_CNT_V << TWAI_IDLE_INTR_CNT_S)
#define TWAI_IDLE_INTR_CNT_V  0xFFFFFFFFU
#define TWAI_IDLE_INTR_CNT_S  0

/** TWAI_ECO_CFG_REG register
 *  ECO configuration register.
 */
#define TWAI_ECO_CFG_REG (DR_REG_TWAI_BASE + 0x90)
/** TWAI_RDN_ENA : R/W; bitpos: [0]; default: 0;
 *  Enable eco module.
 */
#define TWAI_RDN_ENA    (BIT(0))
#define TWAI_RDN_ENA_M  (TWAI_RDN_ENA_V << TWAI_RDN_ENA_S)
#define TWAI_RDN_ENA_V  0x00000001U
#define TWAI_RDN_ENA_S  0
/** TWAI_RDN_RESULT : RO; bitpos: [1]; default: 1;
 *  Output of eco module.
 */
#define TWAI_RDN_RESULT    (BIT(1))
#define TWAI_RDN_RESULT_M  (TWAI_RDN_RESULT_V << TWAI_RDN_RESULT_S)
#define TWAI_RDN_RESULT_V  0x00000001U
#define TWAI_RDN_RESULT_S  1

/** TWAI_TIMESTAMP_DATA_REG register
 *  Timestamp data register
 */
#define TWAI_TIMESTAMP_DATA_REG (DR_REG_TWAI_BASE + 0x94)
/** TWAI_TIMESTAMP_DATA : RO; bitpos: [31:0]; default: 0;
 *  Data of timestamp of a CAN frame.
 */
#define TWAI_TIMESTAMP_DATA    0xFFFFFFFFU
#define TWAI_TIMESTAMP_DATA_M  (TWAI_TIMESTAMP_DATA_V << TWAI_TIMESTAMP_DATA_S)
#define TWAI_TIMESTAMP_DATA_V  0xFFFFFFFFU
#define TWAI_TIMESTAMP_DATA_S  0

/** TWAI_TIMESTAMP_PRESCALER_REG register
 *  Timestamp configuration register
 */
#define TWAI_TIMESTAMP_PRESCALER_REG (DR_REG_TWAI_BASE + 0x98)
/** TWAI_TS_DIV_NUM : R/W; bitpos: [15:0]; default: 31;
 *  Configures the clock division number of timestamp counter.
 */
#define TWAI_TS_DIV_NUM    0x0000FFFFU
#define TWAI_TS_DIV_NUM_M  (TWAI_TS_DIV_NUM_V << TWAI_TS_DIV_NUM_S)
#define TWAI_TS_DIV_NUM_V  0x0000FFFFU
#define TWAI_TS_DIV_NUM_S  0

/** TWAI_TIMESTAMP_CFG_REG register
 *  Timestamp configuration register
 */
#define TWAI_TIMESTAMP_CFG_REG (DR_REG_TWAI_BASE + 0x9c)
/** TWAI_TS_ENABLE : R/W; bitpos: [0]; default: 0;
 *  enable the timestamp collection function.
 */
#define TWAI_TS_ENABLE    (BIT(0))
#define TWAI_TS_ENABLE_M  (TWAI_TS_ENABLE_V << TWAI_TS_ENABLE_S)
#define TWAI_TS_ENABLE_V  0x00000001U
#define TWAI_TS_ENABLE_S  0

#ifdef __cplusplus
}
#endif
